{
  "kind": "build_request",
  "title": "Replace hail/snow background with rain effect (spring)",
  "projectName": "Crystalline Beauty",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Implement a new canvas-based RainBackground component that renders a rain effect (falling raindrops with subtle wind drift) as a fixed full-viewport background layer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Spring is here.  Replace hail/snow with rain"
        ]
      },
      "acceptanceCriteria": [
        "A new React component exists at frontend/src/components/RainBackground.tsx that draws and animates raindrops on a <canvas> element.",
        "The rain effect is visually distinct from hail/snow (e.g., elongated drops and/or streaks rather than pellets/flakes).",
        "The canvas remains non-interactive (pointer-events: none) and is fixed to the viewport (covers the full screen)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Preserve the existing background animation performance and accessibility behaviors in the new rain effect: device-pixel-ratio scaling, resize handling, density caps, and prefers-reduced-motion support (reduced motion must not continuously animate).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Replace hail/snow with rain"
        ]
      },
      "acceptanceCriteria": [
        "RainBackground scales correctly on high-DPR displays (uses DPR-aware canvas sizing and drawing coordinates in CSS pixels).",
        "On window resize, RainBackground resizes the canvas and recreates the raindrop field without visual glitches.",
        "Raindrop count is density-based and capped to avoid excessive particles on very large screens.",
        "When prefers-reduced-motion is enabled, the background does not run a requestAnimationFrame loop; it renders a static frame (or otherwise non-animated presentation).",
        "When prefers-reduced-motion changes at runtime, the component updates accordingly (starts/stops animation and redraws)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Replace the current HailBackground usage in the main app layout with the new RainBackground so rain renders behind the existing header/hero/gallery/footer content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Replace hail/snow with rain"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/App.tsx no longer imports/uses HailBackground; it imports/uses RainBackground instead.",
        "All existing foreground UI remains visible and usable (no click/scroll interception from the canvas layer)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Remove or deprecate unused background components related to snow/hail so the codebase no longer includes an active snow/hail background implementation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Replace hail/snow with rain"
        ]
      },
      "acceptanceCriteria": [
        "No snow/hail background component is mounted in the app after the change.",
        "If frontend/src/components/SnowfallBackground.tsx remains, it is either removed or left clearly unused (no imports/references in the app)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn/ui) since they are read-only sources to be composed, not modified.",
    "Respect the existing single-page layout structure and keep the background canvas as a non-interactive fixed layer behind content."
  ],
  "nonGoals": [
    "Do not rewrite the site copy (Header/Hero/Gallery/Footer text) unless required to complete the rain background replacement.",
    "Do not add new backend functionality; backend/main.mo should remain unchanged."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text in build requests."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}