{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Crystalline Beauty — Replace hail/snow background with spring rain effect",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Create a fixed, full-viewport, non-interactive canvas RainBackground that renders animated raindrops with subtle wind drift.",
      "acceptanceCriteria": [
        "A new React component exists at frontend/src/components/RainBackground.tsx that draws and animates raindrops on a <canvas> element.",
        "The rain effect is visually distinct from hail/snow (e.g., elongated drops and/or streaks rather than pellets/flakes).",
        "The canvas remains non-interactive (pointer-events: none) and is fixed to the viewport (covers the full screen)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RainBackground.tsx",
          "operation": "create",
          "description": "Add a new RainBackground React component that renders a full-viewport fixed canvas layer (pointer-events: none) and draws elongated raindrops/streaks with subtle horizontal drift (wind) behind the app content."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Match the existing background animation performance and accessibility behaviors in RainBackground (DPR scaling, resize handling, density caps, prefers-reduced-motion with runtime updates).",
      "acceptanceCriteria": [
        "RainBackground scales correctly on high-DPR displays (uses DPR-aware canvas sizing and drawing coordinates in CSS pixels).",
        "On window resize, RainBackground resizes the canvas and recreates the raindrop field without visual glitches.",
        "Raindrop count is density-based and capped to avoid excessive particles on very large screens.",
        "When prefers-reduced-motion is enabled, the background does not run a requestAnimationFrame loop; it renders a static frame (or otherwise non-animated presentation).",
        "When prefers-reduced-motion changes at runtime, the component updates accordingly (starts/stops animation and redraws)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RainBackground.tsx",
          "operation": "modify",
          "description": "Implement DPR-aware canvas sizing (draw in CSS pixels), recreate raindrop field on resize, apply density-based particle count with min/max caps, and add prefers-reduced-motion support that renders a static frame (no requestAnimationFrame loop) while also responding to runtime motion preference changes."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Replace HailBackground with RainBackground in the main app layout so rain renders behind all existing UI without intercepting interactions.",
      "acceptanceCriteria": [
        "frontend/src/App.tsx no longer imports/uses HailBackground; it imports/uses RainBackground instead.",
        "All existing foreground UI remains visible and usable (no click/scroll interception from the canvas layer)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Swap the background layer from HailBackground to RainBackground, keeping the canvas behind the existing header/hero/gallery/footer content and preserving non-interactive behavior (no click/scroll interception)."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Remove or clearly deprecate unused snow/hail background components so no active snow/hail background implementation remains mounted.",
      "acceptanceCriteria": [
        "No snow/hail background component is mounted in the app after the change.",
        "If frontend/src/components/SnowfallBackground.tsx remains, it is either removed or left clearly unused (no imports/references in the app)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HailBackground.tsx",
          "operation": "delete",
          "description": "Remove the hail background component implementation to ensure the codebase no longer includes an active snow/hail background implementation after RainBackground is wired in."
        },
        {
          "path": "frontend/src/components/SnowfallBackground.tsx",
          "operation": "delete",
          "description": "Remove the unused placeholder SnowfallBackground file so there are no lingering snow background components in the codebase."
        }
      ]
    }
  ]
}